Диплом/src/Documents/СЕК_ВыплатыЗарплаты/СЕК_ВыплатыЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СЕК_ВыплатыЗарплаты</name>
  <registerRecords>AccumulationRegister.СЕК_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.СЕК_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СЕК_Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом/src/AccumulationRegisters/СЕК_ВзаиморасчетыССотрудниками/СЕК_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СЕК_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СЕК_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СЕК_Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Диплом/src/Documents/СЕК_ВыплатыЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ ЗначениеЗаполнено(Выплаты) Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Не заполнено ни одной строчки");
		Отказ = Истина;
		
	КонецЕсли;
	
	// регистр СЕК_ВзаиморасчетыССотрудниками Приход
	Движения.СЕК_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Для Каждого ТекСтрокаВыплаты Из Выплаты Цикл
		Движение = Движения.СЕК_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаВыплаты.Сотрудник;
		Движение.Подразделение = ТекСтрокаВыплаты.Подразделение;
		Движение.Сумма = ТекСтрокаВыплаты.Сумма;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьЗП() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СЕК_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	|	СЕК_ВзаиморасчетыССотрудникамиОстатки.Подразделение КАК Подразделение,
	|	СЕК_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.СЕК_ВзаиморасчетыССотрудниками.Остатки КАК СЕК_ВзаиморасчетыССотрудникамиОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Всем всё выплачено!");
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Строка = Выплаты.Добавить();
		Строка.Сотрудник = Выборка.Сотрудник;
		Строка.Подразделение = Выборка.Подразделение;
		Строка.Сумма = Выборка.СуммаОстаток;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
